{
  "company": "Coriant",
  "website": "https://www.coriant.com",
  "position": "System Architect",
  "period": {
    "bgn": { "year": 2010, "month": 4 },
    "end": { "year": 2014, "month": 7 }
  },
  "summary": "<u><b>hiT7500</b> project</u><br>Specification and integration of 10G/40G/100G new generation transponders from hiT7300 platform / product.<br>Responsible for the technical specification and description regarding the characteristics and the capabilities of optical components supported by the system and their configuration settings.<br><u><b>hiT7300</b> project</u> <br>Functional specification writer for the configuration management aspects of the northbound interfaces used by network management systems.<br>Responsible for the implementation of a new concept for writing the specification documentation using a DSL (Domain Specific Language) called YANG.<br>Design of the entire framework used for the automatic productions that produces releases (issues) of the mentioned documentation in PDF format and an online version using WordPress as a CMS platform. Jenkins was the choice as a CI (Continuous Integration) tool. The framework uses ANT to give support for the building process and SVN as the SCM (Software Configuration Tool).<br>The framework is responsible for the syntax verification of YANG modules, schema generation (XSD’s, XML’s, RelaxNg and Schematron), HTML transformation, publishing and deployment of the resulting HTML files into CMS server.<br> <u><b>NGOA</b> project</u><br>Responsible for the research and gathering of technical, functional requirements as well as defining the management interfaces of next generation ONUs.<br>Analysis on the business perspective, for home and business use cases, where the product would have practical and efficient application.<br>Investigation on hardware equipment between chipsets and their interfaces in order to meet the specified requirements.<br>Development and proposal of several solutions of HW (designs) that satisfied the two business areas.",
  "stack": [
    "WordPress (as CMS platform) + plugin development",
    "PHP, HTML5, CSS3, LESS, Bootstrap framework, JavaScript/jQuery, XML, XSLT",
    "PrinceXML (for PDF generation)",
    "YANG (http://www.rfc-editor.org/rfc/rfc6020.txt) (DSL language) + pyang (YANG validator tool)",
    "Apache Ant (Build tool/library)",
    "Subversion (SVN)",
    "Jenkins (Continuous Integration Server)"
  ],
  "address": {
    "street": "Rua Irmãos Siemens, N1",
    "postal": {
      "code": "2720-093",
      "region": "Amadora"
    },
    "city": "Alfragide",
    "country": {
      "code": "PT",
      "name": "Portugal"
    }
  },
  "sector": "Telecommunications"
}
